[
    {
        "projectNumber": 1,
        "heading": "my portfolio",
        "image": "../../assets/images/portfolio.jpg",
        "description": "The project where I get the chance to show my qualities, interests, and a piece of my personality.\n\nTechnologies:\nHTML, CSS, Sass, JavaScript, Clamp, ITCSS & BEMIT - working with @use and @forward since @import is about to be deprecated. Wireframes made with Figma.",
        "link1": "",
        "link2": "https://github.com/Patrick-Svensson/portfolio-05-2021",
        "linkText1": "",
        "linkText2": "view source code"
    },

    {
        "projectNumber": 2,
        "heading": "gaffer's dock",
        "image": "../../assets/images/gaffers-dock.jpg",
        "description": "Gaffer’s Dock, the very first website by my own design, was developed after only four weeks of studying HTML, CSS, and Bootstrap at Code Institute. Yet, it is fully responsive and functional throughout all devices. The project includes an extensive README.md file and wireframes made in Balsamiq.",
        "link1": "https://github.com/Patrick-Svensson/gaffers-dock",
        "link2": "https://patrick-svensson.github.io/gaffers-dock/",
        "linkText1": "view source code",
        "linkText2": "view website"
    },

    {
        "projectNumber": 3,
        "heading": "paradox",
        "image": "../../assets/images/paradox.jpg",
        "description": "The little girl standing in the archway and the woman to the right in the background are the same person.\n\nWith Object Selection and the Lasso tool, I have isolated the background in the picture with the little girl, putting extra effort into the details in the iron gate. I then replaced the background with the picture of the two women to create the illusion of a paradox.",
        "link1": "",
        "link2": "../../assets/images/paradox-multi.jpg",
        "linkText1": "",
        "linkText2": "view image"
    },

    {
        "projectNumber": 4,
        "heading": "Cinema logo",
        "image": "../assets/images/movie-theatre.png",
        "description": "Figma design for logo, navbar and, footer for a fictitious movie theatre website. The design was created as a wireframe for a group assignment in the IT-Programming course at Sundsgården's Folk Highschool.\n\nIn the design process, I used tools as Auto layout, Arc Plugin and, Font Awesome. The Federo font, together with the earth-tone hues in the colour palette, was chosen to spark the feeling of the early 20th-century.",
        "link1": "",
        "link2": "../../assets/images/movie-theatre.png",
        "linkText1": "",
        "linkText2": "view design"
    }
]
