[
    {
        "projectNumber": 1,
        "heading": "ux research study",
        "image": "../../assets/images/research-bg.jpg",
        "description": "A research study for an online whisky shop I conducted for the milestone project in the Udacity UX Design Course.",
        "link1": "../../assets/images/research-plan.pdf",
        "link2": "../../assets/images/research-report.pdf",
        "linkText1": "research plan",
        "linkText2": "research report"
    },

    {
        "projectNumber": 2,
        "heading": "Balsamiq",
        "image": "../../assets/images/balsamiq-bg.png",
        "description": "Wireframes made with the low fidelity mockup tool Balsamiq. They were made for a static website frontend development project in the bootcamp at Code Institute.",
        "link1": "../../assets/images/balsamiq-desktop.pdf",
        "link2": "../../assets/images/balsamiq-mobile.pdf",
        "linkText1": "desktop design",
        "linkText2": "mobile design"
    },

    {
        "projectNumber": 3,
        "heading": "paradox",
        "image": "../../assets/images/paradox.jpg",
        "description": "The little girl standing in the archway and the woman to the right in the background are the same person.\n\nWith Object Selection and the Lasso tool, I have isolated the background in the picture with the little girl, putting extra effort into the details in the iron gate. I then replaced the background with the picture of the two women to create the illusion of a paradox.",
        "link1": "",
        "link2": "../../assets/images/paradox-multi.jpg",
        "linkText1": "",
        "linkText2": "view image"
    },

    {
        "projectNumber": 4,
        "heading": "Cinema logo",
        "image": "../assets/images/movie-theatre.png",
        "description": "Figma design for logo, navbar and, footer for a fictitious movie theatre website. The design was created as a wireframe for a group assignment in the IT-Programming course at Sundsgården's Folk Highschool.\n\nIn the design process, I used tools as Auto layout, Arc Plugin and, Font Awesome. The Federo font, together with the earth-tone hues in the colour palette, was chosen to spark the feeling of the early 20th-century.",
        "link1": "",
        "link2": "../../assets/images/movie-theatre.png",
        "linkText1": "",
        "linkText2": "view design"
    }
]
