[
    {
        "projectNumber": 1,
        "heading": "ux research study",
        "image": "../../assets/images/research-bg.jpg",
        "description": "By employing the guerilla design tactics I learned from the Udacity UX Design Course, I quickly managed to plan and conduct this research study for an online whisky shop project in only a few days.",
        "link1": "../../assets/images/research-plan.pdf",
        "link2": "../../assets/images/research-report.pdf",
        "linkText1": "research plan",
        "linkText2": "research report"
    },

    {
        "projectNumber": 2,
        "heading": "balsamiq",
        "image": "../../assets/images/balsamiq-bg.png",
        "description": "I find Balsamiq really easy to use. It is a brilliant tool to quickly create mockups for a design. These were made for my first static website frontend development project in the bootcamp at Code Institute.",
        "link1": "../../assets/images/balsamiq-desktop.pdf",
        "link2": "../../assets/images/balsamiq-mobile.pdf",
        "linkText1": "desktop design",
        "linkText2": "mobile design"
    },

    {
        "projectNumber": 3,
        "heading": "figma",
        "image": "../assets/images/portfolio.jpg",
        "description": "In parallel to my frontend studies, I have also taken the time to get proficient in Figma. I have learned how to make use of Figma's most powerful features, like the auto layout, create components or make prototypes, and I keep learning new features and shortcuts each time I use it. \n\n These are the wireframes for this portfolio. The website itself and my GitHub pages demonstrate the skills in HTML, SCSS and JavaScript I have picked up from the two bootcamps.",
        "link1": "https://github.com/Patrick-Svensson",
        "link2": "../../wireframes/portfolio-desktop.jpg",
        "linkText1": "my GitHub pages",
        "linkText2": "desktop design"
    },

    {
        "projectNumber": 4,
        "heading": "paradox",
        "image": "../../assets/images/paradox.jpg",
        "description": "The little girl standing in the archway and the woman to the right in the background are the same person.\n\nWith Object Selection and the Lasso tool, I have isolated the background in the picture with the little girl, putting extra effort into the details in the iron gate. I then replaced the background with the picture of the two women to create the illusion of a paradox.",
        "link1": "",
        "link2": "../../assets/images/paradox-multi.jpg",
        "linkText1": "",
        "linkText2": "view image"
    }
]
